app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."state" != ? ORDER BY "messages"."created_at" DESC  [["state", "archived"]]
---
  def index
    @messages = Message.where.not(state: 'archived').order(created_at: :desc)

INSERT INTO "messages" ("title", "content", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Test"], ["content", "@@@\r\n"], ["state", "unread"], ["created_at", "2020-12-10 22:38:01.305599"], ["updated_at", "2020-12-10 22:38:01.305599"]]
---
  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save

UPDATE "messages" SET "state" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["state", "read"], ["updated_at", "2020-12-10 22:18:48.427480"], ["id", 980190962]]
---
  def update
    respond_to do |format|
      if @message.update(message_params)

SELECT "messages".* FROM "messages" WHERE "messages"."state" != ? ORDER BY "messages"."created_at" DESC  [["state", "archived"]]
---
  def destroy_all
    @messages = Message.where.not(state: 'archived')